{
    "modules": [
      {
        "id": "module-1",
        "module": "Module 1",
        "title": "Find Your Voice",
        "content": "Part 1\n\nFind Your Voice\n\nMy mantra has always been to make films on issues that deeply affect me at the moment.\n\nKasala! was my love letter to Lagos—a tribute celebrating the incredible tenacity and resilience of Lagosians, seen through the eyes of the film’s strong characters.\n\nWith Otiti, my dad fell sick and eventually passed away. While grappling with his loss, I was forced to confront some difficult Isoko-Delta traditions that deeply angered me. Making the film allowed me to process what it meant to be a modern Nigerian woman facing these traditions.\n\nWhen Nigeria Happens emerged from a conversation I had with a security guard who spoke eloquently but earned just 50,000 naira—less than 40 dollars per month. I couldn't shake this from my mind. It raised a crucial question:\n\n\"At what point would a creative and talented person be broken enough to abandon their dreams and settle for so little?\"\n\nThis conversation opened a deeper dialogue about the harsh realities faced by creatives living in Nigeria, and the constant struggles we encounter just to succeed. Yet, this struggle is universal—it resonates with anyone who has dreams but faces tough choices to survive.\n\nAs a filmmaker, your perspective is unique. No one sees the world exactly the way you do. Finding your voice means looking inward, connecting deeply with your environment, and discovering what genuinely matters to you.\n\nTake a moment and honestly ask yourself these questions:\n\n- Who am I?\n- What makes me happy?\n- What makes me sad or angry?\n- What questions have I been asking myself lately?\n- Is there any conversation I’ve recently had that has stuck with me, that I can't shake off?\n\nReflect on these answers—within them, you might just find the seed of your next film.\n\nFinding My Theme\n\nEvery day, millions of films are made around the world. Your goal as a filmmaker is to stand out by being unique. Yes, I know you might dream of blowing up the Third Mainland Bridge or envisioning a high-concept chase scene with 15,000 police officers running through Obalende.\n\nAnd while these ambitious ideas are exciting, the reality is that at the start of your career, resources are limited. The question then becomes—how do you still stand out?\n\nThe answer is simple: use what you have.\n\nBy answering the questions from our previous session, you'll uncover your theme—a truth that genuinely resonates with you. Once you find that theme, identify a container—a realistic world that you have access to—that authentically holds and amplifies your story.\n\nHere's exactly how I found the theme for my film, When Nigeria Happens:\n\n- Who am I?\n  I’m Ema, a Nigerian filmmaker creating films in one of the toughest creative landscapes globally. Facing countless obstacles has taught me how to innovate and craft compelling stories using whatever resources I have. Over time, this limitation became my strength, shaping my unique storytelling voice.\n\n- What truly matters to me?\n  People inspire me deeply. Conversations trigger characters who begin living rent-free in my head, often overwhelming me. Sometimes, this mental overload pushes me into my quiet corner at home, sewing and turning off the noise. Yet even then, the characters remain, waiting for their stories to be told.\n\n- What makes me angry?\n  Injustice. Seeing people suffer needlessly or watching powerful people bully those weaker ignites something within me. It compels me to speak through film.\n\n- What idea couldn’t I shake off?\n  It was an ordinary conversation with a security guard that stayed with me. He spoke eloquently, but beneath his words was deep pain. How could this intelligent man survive and support his family on just a fraction of what he deserved? I couldn’t shake off the injustice of his story.\n\nAnd that's when I realized my theme:\n\nAs Nigerians, we need an honest conversation about the way we’re living—because this isn't normal. My films hold up a mirror to society, prompting us to question how such dynamic, resilient, and talented people are continually pushed to their breaking points.\n\nThis theme is universal—it resonates not only here but anywhere in the world.\n\nRemember, your answers to these questions will change at different points in your life—maybe even daily. The goal is to continually reconnect with these truths, allowing them to shape and amplify your unique voice as a filmmaker.\n\nBy exploring these deeply personal questions through film, we can spark meaningful conversations and inspire real change.\n\nPart 2\n\nBuilding the World\n\nNow that I had my theme, I needed to find a world—a container—to authentically carry this story.\n\nI have always been fascinated by dancers. I'd spend hours watching dance videos on Instagram, mesmerized by how visually appealing and expressive dance could be.\n\nOver time, I noticed a pattern. I'd follow brilliant Nigerian dancers who'd start off strong, then slowly fade away and disappear. This pattern wasn't limited to dancers; it happened across many Nigerian creative fields. Only a few managed to break through and become internationally recognized stars.\n\nThis observation made it clear to me: the dance world was the perfect container for my theme—the story of talented, resilient people being pushed to their breaking points.\n\nFortunately, I'm a huge fan of one of Africa’s best contemporary dancers, Qudus Onikeku. I'd attended several of his performances in Lagos and admired his incredible depth, style, and passion. I knew his expressive form of contemporary dance—where the bodies tell stories beyond just planned choreography—would perfectly capture the authenticity and emotional depth my story needed.\n\nExcitedly, I reached out to Qudus with the idea. To my delight, he immediately agreed to partner with me—yippee!\n\nBuilding the Script\n\nEvery story I write starts from something real that stays with me. My conversation with the security guard kept coming back—the idea of a talented man pushed to his breaking point, forced to earn just $40 a month to feed his family. It made me ask: How can something be powerful enough to break a person's spirit and force them to abandon their dreams?\n\nTo bring this idea to life, I collaborated with a very talented writer, Bayo Oduwole. Before we even began writing, we talked at length about what kind of situation could realistically push someone to their breaking point. Often, it involves financial burdens or dependent family members. And the story began taking shape around that core idea.\n\nAs we talked, stories I’d heard over the years resurfaced: children grieving their mother who never returned from shopping, and a talented person forced to abandon their dreams due to unexpected financial responsibilities. These stories guided us to build strong characters, authentic conflicts, and emotional truths. And then we found our protagonist—Fagbo, a gifted dancer navigating the vibrant Lagos creative scene. Around him, we placed a community of dancers, artists, and dreamers—people boldly living life on their own terms, embodied in the character Poco.\n\nBut then comes the breaking point: Fagbo’s mother falls critically ill. Suddenly, creativity and passion can't pay medical bills. The crushing weight of financial responsibility breaks his spirit. To save his mother, Fagbo sacrifices his dream, forced into a low-paying security job.\n\nThe antagonist isn’t just one character—it’s the entire world, the system designed to break someone like Fagbo. The struggle becomes universal, echoing challenges we all recognize.\n\nBy grounding the story in genuine emotion and real-world situations, the script grew from a single haunting conversation into something profoundly human and universally relatable.\n\nThis is how you build your script. Take your theme, your truth, and the stories you can't shake—and put them into a world you love, are curious about, and understand.",
        "videoSrc": "/videos/WHN.mov" }
      ,
      {
        "id": "module-2",
        "module": "Module 2",
        "title": "Casting – 95% of My Work is Finding the Right Actors",
        "content": "Casting: 95% of My Work is Finding the Right Actors\n\nFor me, casting is everything. Once I find the right actors, 95% of my work is done.\n\nFor When Nigeria Happens, I knew I couldn’t just cast anyone. The emotions in this film had to be felt, not just spoken. Movement had to tell the story as much as words. That’s why working with non-dancers was never an option.\n\nI had been following Qudus Onikeku’s dancers for a while. His teaching goes beyond choreography—he unlocks something deeper, allowing his dancers’ bodies and souls to tell stories beyond rehearsed steps. I knew they had what it took to bring my vision to life.\n\nBut there was one big risk—they had never acted in a film before. Could they dance, deliver dialogue, and express raw, complex emotions on screen? I wasn’t sure.\n\nTaking the Risk & Finding Magic\n\nWalking into the auditions, I was nervous. But the moment we started, I knew the risk was worth it.\n\nThen came Dominic Abella. He walked in, nervous. I wasn’t fully convinced—until I paired him with Elfigo, who we were considering for Pocoo. The chemistry between them was electric. Right then, I knew—Dominic was my Fagbo.\n\nWhat I Look for in Actors\n\n- Look Beyond the Surface: Some actors may not impress at first, but something about them lingers. Always trust your instincts.\n- Give New Actors a Chance: I love working with fresh faces because they give everything to the role. They are hungry, committed, and ready to prove themselves.\n- Can They Take Direction?: I often ask actors to drop the script and improvise a simple action—like moving across the room while making emotional choices. If they adjust naturally to my instructions, I know they can handle the fast-moving nature of filmmaking.\n- Collaboration Over Control: I see my actors as collaborators, not just performers. I engage in real conversations about the characters and their world, wanting actors who bring their own lived experiences into their roles.\n- Can We Be Comfortable & Vulnerable Together?: Filmmaking is hard work. I need actors who understand that we are in this together, putting our hearts into making the most honest film possible.\n\nFinal Thoughts\n\nTaking a chance on non-actors and dancers was a risk, but it paid off. I found actors who didn’t just play their roles—they lived them. And that made all the difference.\n\nDirecting Performance: Guiding Actors to Embody Emotion\n\nEvery human, no matter where they are from, understands the substance of emotions—love, anger, happiness, and fear. As a director, my job isn’t to force emotions but to guide my actors to tap into something real and present it in a way that’s honest and authentic.\n\nHow I Direct Emotion\n\nI always ask myself: How can this actor best embody emotion in this moment?\n\nIn one intimate scene between Fagbo and Pocoo, I knew their connection had to feel real and unforced. Instead of merely blocking the scene, I created an environment for them to naturally discover that emotional truth. I encouraged them to bring something personal into the scene—something from their own lives that made them feel vulnerable. I focused on small, natural interactions—eye contact, hesitation, body language—rather than forcing a rehearsed performance. I made sure they weren’t just “acting” but truly existing in the moment.\n\nThis approach applies to every scene. I don’t just want performances—I want truth.",
        "videoSrc": "/videos/WHN.mov" }
      ,
      {
        "id": "module-3",
        "module": "Module 3",
        "title": "Cinematography & Visual Storytelling: The System & The City as the Antagonist",
        "content": "Cinematography & Visual Storytelling: The System & The City as the Antagonist\n\nMy background as a video journalist for the BBC and other news networks has shaped my approach to cinematography. Coming from a documentary filmmaking style, I focus on capturing reality as raw and unfiltered as possible.\n\nI do not shy away from the rawness of Africa. I love Lagos, and in my films, Lagos is not just a backdrop—it is a character, an antagonist. The system and the city itself are forces working against the characters. They are constantly struggling, pushing against something bigger than themselves. I wanted to visually show the scale of this oppression—how the world resists, swallows, and challenges them.\n\nFinding Your Visual Voice\n\nAs a director, finding your voice is crucial. One way to develop this is by studying the works of filmmakers, photographers, and cinematographers whose styles resonate with you. Observe how they use light, movement, framing, and composition, and try incorporating these elements into your own work. Over time, you’ll notice stylistic choices emerging that form your unique visual language.\n\nInspiration from La Haine (1995)\n\nA big inspiration for When Nigeria Happens was La Haine (1995). I was captivated by its fluid camera movement—how the camera danced through the world of the characters. I wanted that same energy: having actors move in and out of the frame seamlessly, with minimal cuts, making each scene feel like one continuous orchestra of movement. The camera wasn’t just an observer; it became part of the rhythm, breathing with the actors and responding to their energy.\n\nThe Look & Feel\n\n- The Cinematography Was Based on Scale: I wanted to show how the character navigates the vast, oppressive environment. By using wide shots, the characters appear small against the vastness of their surroundings, emphasizing the struggle against overwhelming forces.\n- Framing & Composition: I used frames within frames—doorways, windows, confined spaces—to visually trap the characters, reinforcing the feeling of being boxed in.\n- Lenses & Perspective: Relying on wide lenses and distant shots maintained a documentary feel, allowing the audience to observe rather than be spoon-fed emotions.\n- Lighting & Color: The world had to feel bold, bright, and alive yet oppressive. The vibrant costumes contrasted with the harsh, chaotic environment, reinforcing the battle between self-expression and survival.\n\nShooting Dance\n\nDance plays a crucial role in the film. I didn’t want the dance sequences to feel like a music video; they had to be raw, emotional, and authentic. I maintained wide shots, allowing the audience to observe the dancers’ movements as a natural storytelling method. The focus was on capturing passion and conviction—showing bodies in unison, narrating a story through movement.\n\nFinal Thought\n\nThe cinematography in When Nigeria Happens is about contrast and resistance—the struggle of the characters against their environment. Every shot was designed to make you feel the battle, not just watch it.\n\nLighting Breakdown: Keeping It Minimal & Natural\n\nI prefer natural light over complex setups. For When Nigeria Happens, 85% of the film was shot outdoors, embracing the harsh Nigerian sun to enhance the raw, realistic feel. Techniques like diffusers, reflectors, and minimal artificial lighting were used to maintain authenticity.",
        "videoSrc": "/videos/WHN.mov" }
      ,
      {
        "id": "module-4",
        "module": "Module 4",
        "title": "Production & Execution: Maximizing Resources & Building the Right Team",
        "content": "Production & Execution: Maximizing Resources & Building the Right Team\n\nWhen shooting, our mantra is to maximize our budget using limited resources. The film could have featured a high-speed chase or an elite dance company on tour, but we set it in the world of local street dancers—working within our budget while staying true to the story.\n\nBudget: Working Smart with Limited Resources\n\nFilmmaking is about making smart choices within financial limits. Every decision—from locations to costumes to equipment—was made to get the most value without compromising quality. We embraced what we had, building a world that fit our budget naturally with authentic yet affordable settings.\n\nRehearsals & Pre-Planning: The Key to a Smooth Shoot\n\nWe spent days rehearsing both dance routines and the script. This preparation allowed the actors to master their choreography, dialogue, and emotional beats, making filming efficient and organic.\n\nLocations: Using What We Had & Keeping Costs Low\n\nWe shot in accessible, affordable locations:\n- My House\n- A Staff Member’s Home\n- A Crew Member’s Neighborhood\n- The Outskirts of the City (cheaper and less crowded)\n- Quick urban shoots in the City Center to avoid extra costs\n\nCostumes: Creative & Budget-Friendly Choices\n\nThe costume designer and I created vibrant, rebellious looks using affordable second-hand clothing. This kept the wardrobe authentic while making a strong visual statement.\n\nEquipment: Small, Efficient, & Documentary-Style\n\nWe used a Sony FX3 for its flexibility and discretion. With a lean crew and minimal gear, we maintained mobility and a low profile, essential for our documentary-style shooting.\n\nFinal Thought\n\nFilmmaking isn’t about having the biggest budget—it’s about using what you have wisely. By choosing the right locations, costumes, equipment, and team, we created a film that feels bigger than its budget.",
        "videoSrc": "/videos/WHN.mov" }
      ,
      {
        "id": "module-5",
        "module": "Module 5",
        "title": "Editing & Sound Design: Shaping the Story in Post-Production",
        "content": "Editing & Sound Design: Shaping the Story in Post-Production\n\nEditing is where a film truly takes shape. The process can completely change a movie by restructuring scenes, refining performances, or even rewriting the story. It’s here that rhythm, pacing, and emotional impact come together.\n\nEditing: A One-Take Approach\n\nI edited the film myself and planned to make the process seamless by intentionally shooting entire scenes in one take. This approach captured the fluid, organic feel of dance, making the movement feel uninterrupted and preserving the documentary-style realism.\n\nScene Breakdown\n\nEvery scene was carefully reworked during editing to ensure that the emotional beats landed effectively. Performances were fine-tuned, timing adjusted, and scenes rearranged to strengthen the narrative flow.\n\nSound Design & Music\n\nMusic is key—it sets the tone and emotional depth. For this film, the soundtrack was chosen to feel raw, African, and deeply emotional, avoiding predictable genres. Collaborations with composers like Tunde Obajeun and Jean-Loup added layers of depth to key emotional moments.\n\nColor Grading: Keeping It Raw & Real\n\nI communicated with my colorist to achieve a natural, documentary feel with saturated, bold colors that stayed true to the natural lighting of Lagos. The final grade brought the film to life without an overly polished look.\n\nClosing\n\nPost-production is where every choice—from editing to sound and color—shapes the final audience experience. Shooting in long takes made the editing process organic, ensuring that every element worked in harmony to create an immersive, emotionally powerful film.",
        "videoSrc": "/videos/WHN.mov" }
      ,
      {
        "id": "module-6",
        "module": "Module 6",
        "title": "Monetization & Distribution: Owning Your Audience & Growing Sustainably",
        "content": "Monetization & Distribution: Owning Your Audience & Growing Sustainably\n\nAs an independent filmmaker, you won’t always have the budget for a big-budget film. Instead, your goal should be to use what you have, build an audience, and connect with people who will become loyal supporters of your work.\n\nThinking Like a Startup: Your Film as an MVP\n\nSee yourself as a startup, treating your film as a Minimum Viable Product (MVP). This means creating, testing, and refining not just the film, but also your audience. As you grow your craft, your audience grows, helping you finance bigger projects in the future.\n\nMonetization Starts Before the Film is Made\n\nA common mistake is waiting until after the film is complete to think about monetization. Instead, plan for your audience from the very beginning by writing for a niche group that will actually buy your film.\n\nFilm Festivals: A Platform to Be Seen\n\nFilm festivals are a great way to showcase your work and connect with an engaged audience. Festival audiences appreciate films that are personal, reflective, and connect emotionally.\n\nKnowing My Niche & Playing to My Strengths\n\nOver time, I’ve accepted that I cannot make films for everyone—and I don’t want to. I make character-driven films for audiences who value deep, personal storytelling. Building a loyal audience is key to sustainable success as an independent filmmaker.\n\nClosing: Your Filmmaking Journey Begins Now\n\nFilmmaking is more than just telling stories—it’s about finding your voice, building your audience, and staying true to the stories that matter. Every great filmmaker starts somewhere. The key is to work with what you have, refine your craft, and never stop creating.\n\nBonus Content to Keep You Inspired:\n- My full script – A deep dive into the structure and writing process.\n- Deleted scenes – Discover what was cut and why.\n- Exclusive behind-the-scenes material – Get an inside look at the filmmaking process.\n\nNow, it’s your turn. Go out there, tell your stories, embrace your journey, and create films that speak to the world in your own unique way. I can’t wait to see what you make!",
        "videoSrc": "/videos/WHN.mov" 
      }
    ]
  }
  